<?php
/**
 * Конфигурация импорта
 * User: Rudi
 * Date: 05.07.2017
 */

return [
	'cian' => [
		'db' => [ // Конфигурация подключения к БД
			'dsn'      => 'mysql',
			'host'     => 'localhost:6001',
			'username' => 'user',
			'password' => '',
			'charset'  => 'utf8',
			'dbname'   => 'cian'
		],
		'validate' => [ // Конфигурация валидатора
			'house_number' => 1,  // 0 - Нет проверки номера дома, 1 - Есть проверка
			'floor'        => 1,  // 0 - Нет проверки, 1 - Есть проверка
			'floors'       => 1   // 0 - Нет проверки, 1 - Есть проверка
		]
	],
	'avito' => [
		'db' => [ // Конфигурация подключения к БД
			'dsn'      => 'mysql',
			'host'     => 'localhost:6002',
			'username' => 'user',
			'password' => '',
			'charset'  => 'utf8',
			'dbname'   => 'avito'
		],
		'validate' => [ // Конфигурация валидатора
			'house_number' => 0,  // 0 - Нет проверки номера дома, 1 - Есть проверка
			'floor'        => 0,  // 0 - Нет проверки, 1 - Есть проверка
			'floors'       => 0   // 0 - Нет проверки, 1 - Есть проверка
		]
	]
];